//
// Задача № 64
//
// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите число N: ");
        int N = int.Parse(Console.ReadLine());

        PrintNumbersFromNto1(N);

        Console.ReadLine();
    }

    static void PrintNumbersFromNto1(int N)
    {
        if (N > 0)
        {
            Console.Write(N);
            if (N > 1)
                Console.Write(", ");

            PrintNumbersFromNto1(N - 1);
        }
    }
}


//
// Задача №66
//
// Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

﻿using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите значение M: ");
        int M = int.Parse(Console.ReadLine());

        Console.Write("Введите значение N: ");
        int N = int.Parse(Console.ReadLine());

        int sum = CalculateSumOfNaturalNumbers(M, N);

        Console.WriteLine($"Сумма натуральных чисел от {M} до {N} = {sum}");

        Console.ReadKey();
    }

    static int CalculateSumOfNaturalNumbers(int M, int N)
    {
        if (M == N) 
        {
            return M;
        } 
        else 
        {
            return M + CalculateSumOfNaturalNumbers(M + 1, N);
        }
    }
}

//
// Задача № 68
//
// Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите значение M: ");
        int M = int.Parse(Console.ReadLine());

        Console.Write("Введите значение N: ");
        int N = int.Parse(Console.ReadLine());

        int sum = CalculateSumOfNaturalNumbers(Math.Min(M, N), Math.Max(M, N));

        Console.WriteLine($"Сумма натуральных чисел от {Math.Min(M, N)} до {Math.Max(M, N)} = {sum}");

        Console.ReadKey();
    }

    static int CalculateSumOfNaturalNumbers(int start, int end)
    {
        if (start == end)
        {
            return start;
        }
        else
        {
            return start + CalculateSumOfNaturalNumbers(start + 1, end);
        }
    }
}
